# Rebar Crank Overridable Parameters Get Crank End Straight Length Formula Params Method

Source: https://www.revitapidocs.com/2026/c2d62923-195d-b2cf-fbd0-59fe5bb3eef1.htm

---

| Rebar Crank Overridable Parameters Get Crank End Straight Length Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankEndStraightLengthFormulaParams()
```

```
Public Function GetCrankEndStraightLengthFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankEndStraightLengthFormulaParams()
```

```
member GetCrankEndStraightLengthFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
returns the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace